** DONE output src block into results area                      :org:leisure:
  CLOSED: [2013-11-06 Wed 14:33]

Results go after #+RESULTS:, with : at the start of each line
evaluation clears out the previous : lines right underneath RESULTS, like this...

#+begin_src js
console.log('hello\nthere\n')
return 3
#+end_src

#+RESULTS:
: hello
: there
:
: 3

  :PROPERTIES:
  :ID:       19ccacf7-e234-43a5-82a2-fd8facbab0f1
  :END:
